<center>
<div>
    <img src="./src/logo.svg" alt="">
</div>
    <b>© Jesús López 2022</b>
    <br>Follow him on <a href="https://twitter.com/jsulopzs">Twitter</a> or <a href="https://linkedin.com/in/jsulopzs"><b>LinkedIn</b></a>
</center>

# What happens when you execute a `function()`?

**Table of Contents**

1. [The Library](#1.-The-Library)
2. [The Dot Notation](#2.-The-Dot-Notation)
3. [The Function](#3.-The-Function)
4. [Giving Objects to the Parameters](#4.-Giving-Objects-to-the-Parameters)
5. [The Function Returns an Object](#5.-The-Function-Returns-an-Object)
6. [The Execution: Inside the Black Box](#6.-The-Execution:-Inside-the-Black-Box)

## The Challenge

- [ ] How to load an `Excel` file ...

![](src/excel.png)

- ... in Python ↓

# The Covered Solution

In [12]:
?? # read the full story to find out the solution

           name  internet_usage     sex  age    education  weight
0      Josefina               0  Female   66   Elementary      81
1         Vicki               1    Male   72   Elementary      78
2         David               1    Male   48   University      69
3        Curtis               0    Male   59          PhD     107
4     Josephine               1  Female   44          PhD      80
...         ...             ...     ...  ...          ...     ...
2450    Frances               1    Male   43   Elementary      94
2451      Harry               1  Female   18  High School      70
2452       Adam               0  Female   54   Elementary      60
2453  Christine               1    Male   31  High School      89
2454   Kimberly               0    Male   52   Elementary      88

[2455 rows x 6 columns]

## 1. The Library

1. ✅ Think of the library that may contain
2. the `function()` that *loads the Excel file*

In [10]:
import pandas

In [ ]:
pandas.

## 2. The Dot Notation

1. ✅ `library.↹` to get the **autocompletion list**
2. of all functions inside the library 

![](src/suggestion.gif)

## 3. The Function

1. Apply [**intuition**](<../01_Code of Discipline/01_Deduction Method.md>) to let Python
2. give you the name of the `function()`
3. that loads the `Excel` file
- [ ] **Which word** do you think the function contains?

![](src/excel-suggestion.gif)

## 4. Giving Objects to the Parameters

- Pass the `objects` to the `parameters`

### A. `(io='internet_usage_spain.xlsx')`

- we pass the `string` object `'internet_usage_spain.xlsx'` to the parameter `io`
    - because it's the name of the `Excel` file we want to load

In [11]:
pandas.read_excel(io='internet_usage_spain.xlsx')

  nombre  peso
0   pepe    34
1  juana    78
2  maria    36

1. [ ] How can we change the configuration of the `function()`
2. to load the second table?
    1. You should **ask yourself**: is there any `(parameter=?)`
    2. to choose the table sheet?
    3. Ask Python with `shift` + `↹` inside the parenthesis

![](src/change-parameter.gif)

### B. `(sheet_name=1)`
- we pass the `integer` object `1` to the parameter `sheet_name`
    - beacuse it's the position of the `Sheet` we want to load

In [12]:
pandas.read_excel(io='internet_usage_spain.xlsx', sheet_name=1)

           name  internet_usage     sex  age    education  weight
0      Josefina               0  Female   66   Elementary      81
1         Vicki               1    Male   72   Elementary      78
2         David               1    Male   48   University      69
3        Curtis               0    Male   59          PhD     107
4     Josephine               1  Female   44          PhD      80
...         ...             ...     ...  ...          ...     ...
2450    Frances               1    Male   43   Elementary      94
2451      Harry               1  Female   18  High School      70
2452       Adam               0  Female   54   Elementary      60
2453  Christine               1    Male   31  High School      89
2454   Kimberly               0    Male   52   Elementary      88

[2455 rows x 6 columns]

## 5. The Function Returns an Object

In [3]:
import pandas

In [5]:
pandas.read_excel(io='data/internet_usage_spain.xlsx', sheet_name=1)

           name  internet_usage     sex  age    education  weight
0      Josefina               0  Female   66   Elementary      81
1         Vicki               1    Male   72   Elementary      78
2         David               1    Male   48   University      69
3        Curtis               0    Male   59          PhD     107
4     Josephine               1  Female   44          PhD      80
...         ...             ...     ...  ...          ...     ...
2450    Frances               1    Male   43   Elementary      94
2451      Harry               1  Female   18  High School      70
2452       Adam               0  Female   54   Elementary      60
2453  Christine               1    Male   31  High School      89
2454       Pepe               0    Male   52   Elementary      88

[2455 rows x 6 columns]

In [8]:
type(pandas.read_excel(io='data/internet_usage_spain.xlsx', sheet_name=1))

pandas.core.frame.DataFrame

## 6. The Execution: Inside the Black Box

- [ ] What's tha **magic** that happens inside the computer?

![](src/read-error.png)

![](src/source-code.gif)

# Reflections

Do you believe that Python knows about an **Excel file**?

- It doesn't

Python knows a `string`: `"data/internet_usage_spain.xlsx"` that will be use to go through the folder system

In [6]:
'data/internet_usage_spain.xlsx'

'data/internet_usage_spain.xlsx'

Do you believe that Python knows about the **sheet name** within the Excel file?

- It doesn't

Python knows an `integer`: `1` that will be used to access the second table within the Excel file

In [7]:
1

1

In [5]:
pandas.read_excel(io='data/internet_usage_spain.xlsx', sheet_name=1)

           name  internet_usage     sex  age    education  weight
0      Josefina               0  Female   66   Elementary      81
1         Vicki               1    Male   72   Elementary      78
2         David               1    Male   48   University      69
3        Curtis               0    Male   59          PhD     107
4     Josephine               1  Female   44          PhD      80
...         ...             ...     ...  ...          ...     ...
2450    Frances               1    Male   43   Elementary      94
2451      Harry               1  Female   18  High School      70
2452       Adam               0  Female   54   Elementary      60
2453  Christine               1    Male   31  High School      89
2454       Pepe               0    Male   52   Elementary      88

[2455 rows x 6 columns]

# Other Examples

- [ ] request from api
- [ ] read json
- [ ] read html
- [ ] do some other expectacular thing...

<a rel="license" href="http://creativecommons.org/licenses/by-nc-nd/4.0/"><img alt="Creative Commons License" style="border-width:0" src="https://i.creativecommons.org/l/by-nc-nd/4.0/88x31.png" /></a><br />This work is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nc-nd/4.0/">Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License</a>.